Revit 2027 API
CompoundStructure.CutoffHeight Property
 Horizontal segments below or at the cutoff height have their distance to the wall bottom fixed, those above have their distance to the wall top fixed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CutoffHeight { get; set; }
Public Property CutoffHeight As Double
	Get
	Set
public:
property double CutoffHeight {
	double get ();
	void set (double value);
}
member CutoffHeight : float with get, set
Property Value
Double
 The cutoff height of this CompoundStructure.
Exceptions
Exception | Condition
InvalidOperationException |  This operation is valid only for vertically compound structures.
Remarks
 This allows layers with one horizontal segment above and one below this line to be of variable height.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace